backend/controllers/SiteController.php

UPDATE `user` SET `last_active`=1720977975, `updated_at`=1720977975 WHERE `id`=1
---
                        }else{
                            Yii::$app->user->login($resUser, $rememberMe ? 3600 * 24 * 30 : 0);
                            $user->last_active = time();
                            $user->save(false);