common/models/Post.php

SELECT COUNT(*) FROM `post` WHERE (`status` <> 0) AND (`type` IN (1, 2, 3))
---
    public function getTotalPostCount()
    {
        $postAllow = [];
        $postAllow[] = Post::TYPE_NORMAL;
        $postAllow[] = Post::TYPE_COMPETITION;
        $postAllow[] = Post::TYPE_CLUB;
        return Post::find()->where(['<>','status',self::STATUS_DELETED])->andWhere(['type'=>$postAllow])->count();

SELECT COUNT(*) FROM `post` WHERE (`status` <> 0) AND (`post`.`type`=4)
---
    public function getTotalReelsCount()
    {
        return Post::find()->where(['<>','status',self::STATUS_DELETED])->andWhere(['post.type'=> Post::TYPE_REEL])->count();

SELECT * FROM `post` WHERE (`status` <> 0) AND (`type` IN (1, 2, 3)) ORDER BY `id` DESC LIMIT 13
---
    public function getLatestPost()
    {
        $postAllow = [];
        $postAllow[] = Post::TYPE_NORMAL;
        $postAllow[] = Post::TYPE_COMPETITION;
        $postAllow[] = Post::TYPE_CLUB;
        return Post::find()
        ->where(['<>','status',Post::STATUS_DELETED])
        ->andWhere(['type'=>$postAllow])->orderBy(['id'=>SORT_DESC])->limit(13)->all();