common/models/Setting.php

    public function getSettingData()
    {
        return $this->find()->orderBy(['id'=>SORT_DESC])->one();
---
SELECT * FROM `setting` ORDER BY `id` DESC

    public function updateSettingData()
    {
        $res= $this->find()->orderBy(['id'=>SORT_DESC])->one();
        $res->site_url = Yii::$app->params['siteUrl'];
        $res->save(false);
---
SELECT * FROM `setting` ORDER BY `id` DESC
UPDATE `setting` SET `site_url`='https://example.com' WHERE `id`=1


                        }else if($replyCode =='UP'){
                            $resultSetting->user_p_id=$code;
                            $resultSetting->save(false);
---
UPDATE `setting` SET `user_p_id`='db261297-3e48-4276-a86d-029f2db3edfa' WHERE `id`=1