common/models/User.php

SELECT * FROM `user` WHERE (`status`=10) AND ((`username`='admin') OR (`email`='admin'))
---
    public static function findByUsernameEmail($username)
    {

        return static::find()->where(['status' => self::STATUS_ACTIVE])
            ->andWhere(['or', ['username' => $username], ['email' => $username]])->one();