backend/models/User.php

SELECT COUNT(*) FROM `user` WHERE (`role`=3) AND (`status` <> 0)
---
    public function getUserCount()
    {
        return $this->find()->where(['role' => self::ROLE_CUSTOMER])->andWhere(['<>','status', self::STATUS_DELETED])->count();

SELECT * FROM `user` WHERE (`role`=3) AND (`status` <> 0) ORDER BY `id` DESC LIMIT 8
---
    public function getLatestUsers()
    {
        return  $this->find()->where(['role' => self::ROLE_CUSTOMER])->andWhere(['<>','status', self::STATUS_DELETED])->orderBy(['id'=>SORT_DESC])->limit(8)->all();